#include "Order.h"

////////////////методы класса Order///////////////////////
//в конструкторе задаём номер заказа, дату, отправителя, получателя и стоимость
Order::Order(int num, int dated, int datem, string ship, string cons, float price) : number(num), day(dated), month(datem), shipper(ship), consignee(cons), price(price)
{
	/* тут пусто */
}
//---------------------------------------------------------
Order::~Order() // деструктор
{
	/* тут тоже пусто  */
}
//---------------------------------------------------------
int Order::getNumber() //геттер возвращает номер заказа
{
	return number;
}
//---------------------------------------------------------
int Order::getDay() //геттер возвращает день
{
	return day;
}
//---------------------------------------------------------
int Order::getMonth() //геттер возвращает месяц
{
	return month;
}
//---------------------------------------------------------
float Order::getPrice() //геттер возвращает стоимость заказа
{
	return price;
}
//--------------------------------------------------------
string Order::getShip() //геттер возвращает грузоотправителя
{
	return shipper;
}
//---------------------------------------------------------
string Order::getCons() //геттер возвращает грузопринемателя
{
	return consignee;
}
//------------------------------------------------------------